{"version":"1.0","createdBy":"Snippets","space":{"name":"Snippets","synced":true,"data":{"version":"1.0","timestamp":1701432919626,"children":[{"name":"Placeholders","seq":1,"children":[{"name":"Basic Placeholders","seq":1,"content":"The name of this snippet (Basic Placeholders):\n$[NAME]\n\nThe folder this snippet is in (Placeholders):\n$[FOLDER]\n\nThe full path to this snippet (Snippets/Placeholders):\n$[PATH]\n\nSame as above with a custom delimiter (Snippets > Placeholders):\n$[PATH( > )]\n\nThe name and version of your browser:\n$[HOSTAPP]\n\nThe User Agent your browser identifies as:\n$[UA]","nosub":false},{"name":"Date","seq":2,"content":"The default date display for the locale:\n$[DATE]\n\nThe current date and time with custom formatting:\n$[DATE(ddd, MMM DD, YYYY hh:mm:ss A ZZ)]\n\nLocale-based date strings of decreasing length:\n$[DATE(full)]\n$[DATE(long)]\n$[DATE(medium)]\n$[DATE(short)]","nosub":false},{"name":"Time","seq":3,"content":"The default time display:\n$[TIME]\n\nThe current time with custom formatting:\n$[TIME(h:mm A Z)]\n\nLocale-based time strings of decreasing length:\n$[TIME(full)]\n$[TIME(long)]\n$[TIME(medium)]\n$[TIME(short)]","nosub":false},{"name":"Counters (manage in the settings menu)","seq":4,"content":"A default auto-incrementing counter (1 > 2):\n#[COUNTER]\n\nNumbers in brackets will change the increment. Note that this behaviour is not currently compatible with Clippings.\n\nThis will increase COUNTER by 2 after replacement (2 > 4):\n#[COUNTER(2)]\n\nThis will decrease COUNTER by 2 after replacement (4 > 2):\n#[COUNTER(-2)]\n\nThis will preserve the value of COUNTER after replacement (2 > 2):\n#[COUNTER(0)]","nosub":false},{"name":"RichText","seq":5,"content":"<h1>This is a rich text sample</h1>\nBy default, regular new lines like these two:\n\nwill be marked with rich text line break (<br>) tags so they won't turn into spaces. URLs without anchor tags like https://github.com/jpc-ae/Snippets/issues will be hotlinked automatically along with email addresses like noreply@example.com. This behaviour can be changed in the settings menu.\n\nThe copy button at the top right of this snippet will add both plain and rich text versions of this processed snippet ($[PATH]/$[NAME]) to the clipboard, just like if you'd copied it from a webpage.","nosub":false},{"name":"[NOSUBST] Disabled","seq":6,"content":"The following text will be pasted as-is:\n$[NAME], $[FOLDER], $[PATH]\n$[HOSTAPP], $[UA]\n#[COUNTER]\n$[DATE], $[TIME]\nunlinked.com, email@unlinked.com","nosub":false}]},{"name":"Overview","seq":2,"content":"Welcome to Snippets!\n\nOn the top line you will find a settings menu, the current folder path, a sync icon that allows you to swap between syncronizing your snippets or keeping them local, buttons for adding new folders and snippets in the current folder and a pop-out button to make organizing your snippets easier.\n\nClicking on a folder name will open it. Try clicking the Placeholders folder to see how the path updates.","nosub":false},{"name":"🢀 Try clicking the icon!","seq":3,"color":"Red","content":"Folders and snippets each have an icon that can be clicked for a menu. The options currently available allow you to change the icon colour and move the item up or down manually. To move items around in a list, you can also drag their titles and drop them into a folder or position.\n\nOn the right are buttons to rename or delete the item. Once you get the hang of it, feel free to delete the tutorials!","nosub":false}],"counters":{"startVal":0}},"path":[1]}}